lee-lord/GD32F303RET6/hardware/UART_DMA/UART_DMA.c
#include "gd32f30x.h"
#include "sysType.h"
#include "UART_DMA.h"
#include "MyMath.h"
volatile File_Buffer Uart1DMAbuf;
volatile File_Buffer Uart2DMAbuf;

 
volatile dma_parameter_struct DMA_CH1_Tx_InitStruc;
volatile dma_parameter_struct DMA_CH2_Tx_InitStruc;

U8 Com1RX[TxBufLen];
U8 Com1TX[TxBufLen];

U8 Com2RX[TxBufLen];
U8 Com2TX[TxBufLen];

void DMAbufInit(void)
{
   Uart1DMAbuf.Txfile_pullout=0;
	 Uart1DMAbuf.Txfile_pushin=0;
   Uart1DMAbuf.Rxfile_head=0;
	 Uart1DMAbuf.Rxfile_tail=0;	
	Uart1DMAbuf.RxBuff=Com1RX;
	Uart1DMAbuf.TxBuff=Com1TX;
	 Uart1DMAbuf.busy=0;
	
   Uart2DMAbuf.Txfile_pullout=0;
	 Uart2DMAbuf.Txfile_pushin=0;
   Uart2DMAbuf.Rxfile_head=0;
	 Uart2DMAbuf.Rxfile_tail=0;
   Uart2DMAbuf.RxBuff=Com2RX;
	 Uart2DMAbuf.TxBuff=Com2TX;	
	 Uart2DMAbuf.busy=0;

}


void UartC_DmaInitial(U32 UartX)//U32 DMA_X,dma_channel_enum channelRx,dma_channel_enum channelTx,)
{
    dma_parameter_struct dma_init_struct;
    DMAbufInit();
    /* initialize USART */
    usartAC_config(USART2,256000);
    /* enable DMA0 */
    rcu_periph_clock_enable(RCU_DMA0);	//使能DMA传输
/////////initial DMA RX DMA mode
    dma_deinit(DMA0, DMA_CH2);   //将DMA的通道1寄存器重设为缺省值
    dma_init_struct.direction = DMA_PERIPHERAL_TO_MEMORY;//外设作为数据传输的目的地
    //DMAstruc->DMA_DIR = DMA_DIR_PeripheralDST;  
    dma_init_struct.memory_addr = (uint32_t)Com2RX;//DMA内存基地址
    //DMAstruc->DMA_MemoryBaseAddr = cmar;  
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;  //内存地址寄存器递增
    //DMAstruc->DMA_MemoryInc = DMA_MemoryInc_Enable;
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;//DMA通道 /数据宽度为8位
    //DMAstruc->DMA_MemoryDataSize = DMA_MemoryDataSize_Byte; 
    dma_init_struct.number = TxBufLen;//ARRAYNUM(txbuffer);//DMA通道的DMA缓存的大小
    //DMAstruc->DMA_BufferSize = cndtr;  
    dma_init_struct.periph_addr = USART2_DATA_ADDRESS;//USART_DATA(USART2);//DMA外设ADC基地址
    //DMAstruc->DMA_PeripheralBaseAddr = cpar;  
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;  //外设地址寄存器不变
    //DMAstruc->DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;     //数据宽度为8位
    //DMAstruc->DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    dma_init_struct.priority = DMA_PRIORITY_ULTRA_HIGH;
    //DMAstruc->DMA_Priority = DMA_Priority_Medium; 
    dma_init(DMA0, DMA_CH2, &dma_init_struct);

    /* configure DMA mode */
    dma_circulation_enable(DMA0, DMA_CH2);   
    //DMAstruc->DMA_Mode = DMA_Mode_Circular;//DMA_Mode_Circular;//x拥有中优先级
    dma_memory_to_memory_disable(DMA0, DMA_CH2); //DMA通道x没有设置为内存到内存传输
    ///DMAstruc->DMA_M2M = DMA_M2M_Disable;  
    /* enable DMA channel3 */

             ////////////dma_channel_enable(DMA0, DMA_CH2);
    dma_channel_enable(DMA0, DMA_CH2);
    //DMA_Cmd(DMA_CHx, ENABLE);  //使能USART1 TX DMA1 所指示的通道 
      /////here we intial the interupt of DMA 
     usart_dma_receive_config(USART2, USART_DENR_ENABLE);



    //////////////initial TX DMA 
    /* deinitialize DMA channel3(USART0 tx) */
    dma_deinit(DMA0, DMA_CH1);   //将DMA的通道1寄存器重设为缺省值
    DMA_CH2_Tx_InitStruc.direction = DMA_MEMORY_TO_PERIPHERAL;//外设作为数据传输的目的地
    //DMAstruc->DMA_DIR = DMA_DIR_PeripheralDST;  
    DMA_CH2_Tx_InitStruc.memory_addr = (uint32_t)Com2TX;//DMA内存基地址
    //DMAstruc->DMA_MemoryBaseAddr = cmar;  
    DMA_CH2_Tx_InitStruc.memory_inc = DMA_MEMORY_INCREASE_ENABLE;  //内存地址寄存器递增
    //DMAstruc->DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_CH2_Tx_InitStruc.memory_width = DMA_MEMORY_WIDTH_8BIT;//DMA通道 /数据宽度为8位
    //DMAstruc->DMA_MemoryDataSize = DMA_MemoryDataSize_Byte; 
    DMA_CH2_Tx_InitStruc.number = TxBufLen;//ARRAYNUM(txbuffer);//DMA通道的DMA缓存的大小
    //DMAstruc->DMA_BufferSize = cndtr;  
    DMA_CH2_Tx_InitStruc.periph_addr = USART2_DATA_ADDRESS;//USART_DATA(USART2);//DMA外设ADC基地址
    //DMAstruc->DMA_PeripheralBaseAddr = cpar;  
    DMA_CH2_Tx_InitStruc.periph_inc = DMA_PERIPH_INCREASE_DISABLE;  //外设地址寄存器不变
    //DMAstruc->DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_CH2_Tx_InitStruc.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;	  //数据宽度为8位
    //DMAstruc->DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_CH2_Tx_InitStruc.priority = DMA_PRIORITY_ULTRA_HIGH;
    //DMAstruc->DMA_Priority = DMA_Priority_Medium; 
    dma_init(DMA0, DMA_CH1, (dma_parameter_struct *)&DMA_CH2_Tx_InitStruc);
    /* configure DMA mode */
    dma_circulation_disable(DMA0, DMA_CH1);   
    //DMAstruc->DMA_Mode = DMA_Mode_Normal;//DMA_Mode_Circular;//x拥有中优先级
    dma_memory_to_memory_disable(DMA0, DMA_CH1); //DMA通道x没有设置为内存到内存传输
    ///DMAstruc->DMA_M2M = DMA_M2M_Disable;  
    /* enable DMA channel1  will start TX data*/
    //dma_channel_enable(DMA0, DMA_CH1);
    
    dma_interrupt_flag_clear(DMA0, DMA_CH1, DMA_INT_FLAG_FTF);
    /////here we intial the interupt of DMA 
   // DMA_ITConfig(DMA1_Channel4,DMA_IT_TC,ENABLE);
    dma_interrupt_enable(DMA0,DMA_CH1,DMA_INT_FTF);

    /* USART DMA enable for transmission and reception */
    usart_dma_transmit_config(USART2, USART_DENT_ENABLE);   

    // nvic_priority_group_set(NVIC_PRIGROUP_PRE1_SUB3);
     nvic_irq_enable(DMA0_Channel1_IRQn, 1, 4);
}


void UartA_DmaInitial(U32 UartX)//U32 DMA_X,dma_channel_enum channelRx,dma_channel_enum channelTx,)
{
    dma_parameter_struct dma_init_struct;
    DMAbufInit();
    /* enable DMA0 */
    rcu_periph_clock_enable(RCU_DMA0);	//使能DMA传输
    /* initialize USART */
    usartAC_config(USART0,256000);
    //////////////initial TX DMA 
    /* deinitialize DMA channel3(USART0 tx) */
    dma_deinit(DMA0, DMA_CH3);   //将DMA的通道1寄存器重设为缺省值
    DMA_CH1_Tx_InitStruc.direction = DMA_MEMORY_TO_PERIPHERAL;//外设作为数据传输的目的地
    //DMAstruc->DMA_DIR = DMA_DIR_PeripheralDST;  
    DMA_CH1_Tx_InitStruc.memory_addr = (uint32_t)Com1TX;//DMA内存基地址
    //DMAstruc->DMA_MemoryBaseAddr = cmar;  
    DMA_CH1_Tx_InitStruc.memory_inc = DMA_MEMORY_INCREASE_ENABLE;  //内存地址寄存器递增
    //DMAstruc->DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_CH1_Tx_InitStruc.memory_width = DMA_MEMORY_WIDTH_8BIT;//DMA通道 /数据宽度为8位
    //DMAstruc->DMA_MemoryDataSize = DMA_MemoryDataSize_Byte; 
    DMA_CH1_Tx_InitStruc.number = TxBufLen;//ARRAYNUM(txbuffer);//DMA通道的DMA缓存的大小
    //DMAstruc->DMA_BufferSize = cndtr;  
    DMA_CH1_Tx_InitStruc.periph_addr = USART0_DATA_ADDRESS;//USART_DATA(USART0);//DMA外设ADC基地址
    //DMAstruc->DMA_PeripheralBaseAddr = cpar;  
    DMA_CH1_Tx_InitStruc.periph_inc = DMA_PERIPH_INCREASE_DISABLE;  //外设地址寄存器不变
    //DMAstruc->DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_CH1_Tx_InitStruc.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;	  //数据宽度为8位
    //DMAstruc->DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_CH1_Tx_InitStruc.priority = DMA_PRIORITY_ULTRA_HIGH;
    //DMAstruc->DMA_Priority = DMA_Priority_Medium; 
    dma_init(DMA0, DMA_CH3, (dma_parameter_struct *)&DMA_CH1_Tx_InitStruc);
    /* configure DMA mode */
    dma_circulation_disable(DMA0, DMA_CH3);   
    //DMAstruc->DMA_Mode = DMA_Mode_Normal;//DMA_Mode_Circular;//x拥有中优先级
    dma_memory_to_memory_disable(DMA0, DMA_CH3); //DMA通道x没有设置为内存到内存传输
    ///DMAstruc->DMA_M2M = DMA_M2M_Disable;  
        /* enable DMA channel3 will start to send data by TX pin*/
    ///dma_channel_enable(DMA0, DMA_CH3);
     dma_interrupt_flag_clear(DMA0, DMA_CH3, DMA_INT_FLAG_FTF);

    /* USART DMA enable for transmission and reception */
    usart_dma_transmit_config(USART0, USART_DENT_ENABLE); 	
	
    /////here we intial the interupt of DMA 
   // DMA_ITConfig(DMA1_Channel4,DMA_IT_TC,ENABLE);
    dma_interrupt_enable(DMA0,DMA_CH3,DMA_INT_FTF);
    
/////////initial DMA RX DMA mode
	dma_deinit(DMA0, DMA_CH4);   //将DMA的通道1寄存器重设为缺省值
    dma_init_struct.direction = DMA_PERIPHERAL_TO_MEMORY;//外设作为数据传输的目的地
    //DMAstruc->DMA_DIR = DMA_DIR_PeripheralDST;  
    dma_init_struct.memory_addr = (uint32_t)Com1RX;//DMA内存基地址
    //DMAstruc->DMA_MemoryBaseAddr = cmar;  
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;  //内存地址寄存器递增
    //DMAstruc->DMA_MemoryInc = DMA_MemoryInc_Enable;
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;//DMA通道 /数据宽度为8位
    //DMAstruc->DMA_MemoryDataSize = DMA_MemoryDataSize_Byte; 
    dma_init_struct.number = TxBufLen;//ARRAYNUM(txbuffer);//DMA通道的DMA缓存的大小

    //DMAstruc->DMA_BufferSize = cndtr;  
    dma_init_struct.periph_addr = USART0_DATA_ADDRESS;//USART_DATA(USART0);//DMA外设ADC基地址
    //DMAstruc->DMA_PeripheralBaseAddr = cpar;  
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;  //外设地址寄存器不变
    //DMAstruc->DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;	  //数据宽度为8位
    //DMAstruc->DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    dma_init_struct.priority = DMA_PRIORITY_ULTRA_HIGH;
    //DMAstruc->DMA_Priority = DMA_Priority_Medium; 
    dma_init(DMA0, DMA_CH4, &dma_init_struct);
    /* configure DMA mode */
    dma_circulation_enable(DMA0, DMA_CH4);   
    //DMAstruc->DMA_Mode = DMA_Mode_Circular;//DMA_Mode_Circular;//x拥有中优先级
    dma_memory_to_memory_disable(DMA0, DMA_CH4); //DMA通道x没有设置为内存到内存传输
    ///DMAstruc->DMA_M2M = DMA_M2M_Disable;  
    /* enable DMA channel3 */
    dma_channel_enable(DMA0, DMA_CH4);
    usart_dma_receive_config(USART0, USART_DENR_ENABLE);


      /////here we intial the interupt of DMA 
    // nvic_priority_group_set(NVIC_PRIGROUP_PRE1_SUB3);
     nvic_irq_enable(DMA0_Channel3_IRQn, 1, 3);
}


void usartAC_config(U32 UartX,U32 baudrate)
{
	if(UartX==USART0)
    {
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_USART0);
    rcu_periph_clock_enable(RCU_AF);
    /* configure USART Tx as alternate function push-pull */
    gpio_init(GPIOA,GPIO_MODE_AF_PP,GPIO_OSPEED_50MHZ,GPIO_PIN_9|GPIO_PIN_8);
    gpio_init(GPIOA, GPIO_MODE_IN_FLOATING,GPIO_OSPEED_50MHZ,GPIO_PIN_10);//GPIO_MODE_IPU
    }
    else if(UartX==USART2)
    {
    rcu_periph_clock_enable(RCU_GPIOB);
    rcu_periph_clock_enable(RCU_USART2);
    rcu_periph_clock_enable(RCU_AF);
    /* configure USART Tx as alternate function push-pull */
    gpio_init(GPIOB,GPIO_MODE_AF_PP,GPIO_OSPEED_50MHZ,GPIO_PIN_10);//
    gpio_init(GPIOB,GPIO_MODE_IPU,GPIO_OSPEED_50MHZ,GPIO_PIN_11);//GPIO_MODE_IN_FLOATING
    }

    /* configure USART synchronous mode */
    //usart_synchronous_clock_enable(UartX);
    //usart_synchronous_clock_config(UartX, USART_CLEN_EN, USART_CPH_2CK, USART_CPL_HIGH);
    
    usart_baudrate_set(UartX,baudrate);//115200
    usart_parity_config(UartX,USART_PM_NONE);//No parity  
    usart_word_length_set(UartX,USART_WL_8BIT);// 8 bit
    usart_stop_bit_set(UartX,USART_STB_1BIT);// 1 stop bit
    /* configure USART transmitter */
    usart_transmit_config(UartX, USART_TRANSMIT_ENABLE);
    /* configure USART receiver */
    usart_receive_config(UartX, USART_RECEIVE_ENABLE);
    /* enable USART */
    usart_enable(UartX);
}




__inline  void DMA_SendEn(uint32_t DMA_X,dma_channel_enum channelx,dma_parameter_struct *DMA_Tx_InitStruc,U32 dataLen,U32 dataAdd)
{ 
  dma_channel_disable(DMA_X, channelx );  //关闭USART1 TX DMA1 所指示的通道   4   
    DMA_Tx_InitStruc->number     =   dataLen;
    DMA_Tx_InitStruc->memory_addr = dataAdd;  //DMA内存基地址
  dma_init(DMA_X, channelx, DMA_Tx_InitStruc);
  //DMA_ITConfig(DMA_CHx,DMA_IT_TC,ENABLE);
  dma_channel_enable(DMA_X, channelx);  //使能USART1 TX DMA1 所指示的通道 
} 

/////CH3-Tx CH4-Rx for Uarta
  void DMA0_Channel3_IRQHandler(void)
{
U32 SramAdd=0;
U32 tempLen=0;
if(dma_interrupt_flag_get(DMA0, DMA_CH3, DMA_INT_FLAG_FTF)){     
        dma_interrupt_flag_clear(DMA0, DMA_CH3, DMA_INT_FLAG_FTF);   
    SramAdd = (U32)(&Uart1DMAbuf.TxBuff[Uart1DMAbuf.Txfile_pullout]);
      ///正常情况的发送，天冲在前，发送在后。
       if(Uart1DMAbuf.Txfile_pullout<Uart1DMAbuf.Txfile_pushin)
       {
         tempLen = Uart1DMAbuf.Txfile_pushin -Uart1DMAbuf.Txfile_pullout;
           Uart1DMAbuf.Txfile_pullout =Uart1DMAbuf.Txfile_pushin;
       }// 队列颠倒，填充在后，发送在前，先把队列的尾部发送完成。发送头归零。等下一次发送。
       else if(Uart1DMAbuf.Txfile_pullout>Uart1DMAbuf.Txfile_pushin)
       {  //发送到buf的尾端
         // SramAdd = (U32)(&Uart1DMAbuf.TxBuff[Uart1DMAbuf.Txfile_pullout]);
          tempLen = TxBufLen -Uart1DMAbuf.Txfile_pullout;
          Uart1DMAbuf.Txfile_pullout =0; //LED1=!LED1;
       }

    if(tempLen>0)
    {  
    Uart1DMAbuf.busy=1;  
    DMA_SendEn(DMA0, DMA_CH3,(dma_parameter_struct *)&DMA_CH1_Tx_InitStruc,tempLen,SramAdd);
      //LED1=!LED1;
    }
    else
    Uart1DMAbuf.busy=0;
  }
}

