lee-lord/GD32F303RET6/hardware/UART_DMA/UART_DMA.c
///CH1--Tx Ch2--Rx for UartC
  void DMA0_Channel1_IRQHandler(void)
{
  U32 SramAdd=0;
  U32 tempLen=0;
if(dma_interrupt_flag_get(DMA0, DMA_CH1, DMA_INT_FLAG_FTF)){     
        dma_interrupt_flag_clear(DMA0, DMA_CH1, DMA_INT_FLAG_FTF);
    ///正常情况的发送，天冲在前，发送在后。
    SramAdd = (U32)(&Uart2DMAbuf.TxBuff[Uart2DMAbuf.Txfile_pullout]);  
       if(Uart2DMAbuf.Txfile_pullout<Uart2DMAbuf.Txfile_pushin)
       {
         tempLen = Uart2DMAbuf.Txfile_pushin -Uart2DMAbuf.Txfile_pullout;
           Uart2DMAbuf.Txfile_pullout =Uart2DMAbuf.Txfile_pushin;
        // LED0=!LED0;
       }// 队列颠倒，填充在后，发送在前，先把队列的尾部发送完成。发送头归零。等下一次发送。
       else if(Uart2DMAbuf.Txfile_pullout>Uart2DMAbuf.Txfile_pushin)
       {  //发送到buf的尾端
  //        SramAdd = (U32)(&Uart2DMAbuf.TxBuff[Uart2DMAbuf.Txfile_pullout]);
          tempLen = TxBufLen -Uart2DMAbuf.Txfile_pullout;
          Uart2DMAbuf.Txfile_pullout =0;
        // LED1=!LED1;
       }
     //if(tempLen==1)  LED1=!LED1;
    if(tempLen)
    { 
      Uart2DMAbuf.busy=1;
      DMA_SendEn(DMA0, DMA_CH1,(dma_parameter_struct *)&DMA_CH2_Tx_InitStruc,tempLen,SramAdd);
    }
    else
    Uart2DMAbuf.busy=0;
  }
   // printf("\n\nRx half ISR\n");  
}



  U8 UartA_read(void)
{
  U8 tmp=0;
  tmp = Uart1DMAbuf.RxBuff[Uart1DMAbuf.Rxfile_head++];
  if(Uart1DMAbuf.Rxfile_head>(TxBufLen-1))
    Uart1DMAbuf.Rxfile_head=0;
  return tmp;
}

   U8 UartB_read(void)
{
  return 0;
}


  U8 UartC_read(void)
{
  U8 tmp=0;
    tmp = Uart2DMAbuf.RxBuff[Uart2DMAbuf.Rxfile_head++];
    if(Uart2DMAbuf.Rxfile_head>(TxBufLen-1))
      Uart2DMAbuf.Rxfile_head=0;
    return tmp;
}



   U16 UartA_Available(void)
{
   Uart1DMAbuf.Rxfile_tail=TxBufLen-dma_transfer_number_get(DMA0, DMA_CH4);//DMA_GetCurrDataCounter(DMA1_Channel5); 
  return (Uart1DMAbuf.Rxfile_tail>=Uart1DMAbuf.Rxfile_head)? (Uart1DMAbuf.Rxfile_tail-Uart1DMAbuf.Rxfile_head ):(TxBufLen+Uart1DMAbuf.Rxfile_tail-Uart1DMAbuf.Rxfile_head);
}


  U16 UartB_Available(void)
{
 return 0;

}


   U16 UartC_Available(void)
{
   Uart2DMAbuf.Rxfile_tail=TxBufLen-dma_transfer_number_get(DMA0, DMA_CH2);//DMA_GetCurrDataCounter(DMA1_Channel6); 
  return (Uart2DMAbuf.Rxfile_tail>=Uart2DMAbuf.Rxfile_head)? (Uart2DMAbuf.Rxfile_tail-Uart2DMAbuf.Rxfile_head ):(TxBufLen+Uart2DMAbuf.Rxfile_tail-Uart2DMAbuf.Rxfile_head);
}


////////由中断配合完成一次发送。
////////DMA////////////TAIL//// ---set current data len
///////////////DMA/////////TAIL ---wait for DMA cpmplete
///////TAIL/////////DMA//////// ---set current data len ,let it go 
///////TAIL/////////////////DMA///
   void UartA_write(U8 *pStr ,U16 len)
{
   U16 i=0;
   U32 tempLen=0;
   U32 SramAdd=0;
     for(i=0;i<len;i++)
         {
          Uart1DMAbuf.TxBuff[Uart1DMAbuf.Txfile_pushin]=*(pStr+i);
					  Uart1DMAbuf.Txfile_pushin = Uart1DMAbuf.Txfile_pushin +1;
          if(Uart1DMAbuf.Txfile_pushin==TxBufLen){ Uart1DMAbuf.Txfile_pushin=0; }
          /////here will block to send all data.
					if(Uart1DMAbuf.Txfile_pushin==Uart1DMAbuf.Txfile_pullout)//here overflow now 
					   {
               Uart1DMAbuf.state +=1;
             }  
          }

    if(Uart1DMAbuf.busy==0) // is idle
    {
        SramAdd = (U32)(&Uart1DMAbuf.TxBuff[Uart1DMAbuf.Txfile_pullout]);
      ///正常情况的发送，天冲在前，发送在后。
       if(Uart1DMAbuf.Txfile_pullout<Uart1DMAbuf.Txfile_pushin)
       {
         tempLen = Uart1DMAbuf.Txfile_pushin -Uart1DMAbuf.Txfile_pullout;
         Uart1DMAbuf.Txfile_pullout =Uart1DMAbuf.Txfile_pushin;
       }// 队列颠倒，填充在后，发送在前，先把队列的尾部发送完成。发送头归零。等下一次发送。
       else  if(Uart1DMAbuf.Txfile_pullout>Uart1DMAbuf.Txfile_pushin)
       {  //发送到buf的尾端
          tempLen = TxBufLen -Uart1DMAbuf.Txfile_pullout;
          Uart1DMAbuf.Txfile_pullout =0;
       }
       if(tempLen)
       {
        Uart1DMAbuf.busy=1;
         DMA_SendEn(DMA0, DMA_CH3,(dma_parameter_struct *)&DMA_CH1_Tx_InitStruc,tempLen,SramAdd);
       }
    }
}

  void UartB_write(U8 * pStr,U16 len)
{
    
}


////////DMA////////////TAIL//// ---set current data len
///////////////DMA/////////TAIL ---wait for DMA cpmplete
///////TAIL/////////DMA//////// ---set current data len ,let it go 
///////TAIL/////////////////DMA///
   void UartC_write(U8 *pStr ,U16 len)
{
   U16 i=0;
   U32 tempLen=0;
   U32 SramAdd=0;
    for(i=0;i<len;i++)
         {
       Uart2DMAbuf.TxBuff[Uart2DMAbuf.Txfile_pushin]=*(pStr+i);
        Uart2DMAbuf.Txfile_pushin +=1;
       if(Uart2DMAbuf.Txfile_pushin>(TxBufLen-1)){ Uart2DMAbuf.Txfile_pushin=0;}
        if(Uart2DMAbuf.Txfile_pushin==Uart2DMAbuf.Txfile_pullout)//here overflow now 
             {
               Uart2DMAbuf.state +=1;
             }  
     }

    if(Uart2DMAbuf.busy==0) // is idle
    {
        SramAdd = (U32)(&Uart2DMAbuf.TxBuff[Uart2DMAbuf.Txfile_pullout]);
      ///正常情况的发送，天冲在前，发送在后。
       if(Uart2DMAbuf.Txfile_pullout<Uart2DMAbuf.Txfile_pushin)
       {
         tempLen = Uart2DMAbuf.Txfile_pushin -Uart2DMAbuf.Txfile_pullout;
         Uart2DMAbuf.Txfile_pullout =Uart2DMAbuf.Txfile_pushin;
         //LED1=!LED1;
       }// 队列颠倒，填充在后，发送在前，先把队列的尾部发送完成。发送头归零。等下一次发送。
       else if(Uart2DMAbuf.Txfile_pullout>Uart2DMAbuf.Txfile_pushin)
       {  //发送到buf的尾端
         // SramAdd = (U32)(&Uart2DMAbuf.TxBuff[Uart2DMAbuf.Txfile_pullout]);
          tempLen = TxBufLen -Uart2DMAbuf.Txfile_pullout;
          Uart2DMAbuf.Txfile_pullout =0;  
       }
       if(tempLen)
       {
         Uart2DMAbuf.busy=1;  
         //DMA_SendEn(DMA1_Channel7,&DMA_CH2_Tx_InitStruc,tempLen,SramAdd);
         DMA_SendEn(DMA0, DMA_CH1,(dma_parameter_struct *)&DMA_CH2_Tx_InitStruc,tempLen,SramAdd);
       }
//       else
//        Uart2DMAbuf.busy=0; 
    }
}



void ANO_DT_Send_Status(uint8_t UartX,float angle_rol, float angle_pit, float angle_yaw, int32_t alt, uint8_t fly_model, uint8_t armed)
{
    uint8_t _cnt=0;
    int32_t _temp;
    int32_t _temp2 = alt;
    uint8_t data_to_send[32];
    data_to_send[_cnt++]=0xAA;
    data_to_send[_cnt++]=0xAA;
    data_to_send[_cnt++]=0x01;
    data_to_send[_cnt++]=0;
    
    _temp = (int32_t)(angle_rol*100);
    data_to_send[_cnt++]= (_temp)>>8;
    data_to_send[_cnt++]= (_temp);
    _temp = (int32_t)(angle_pit*100);
    data_to_send[_cnt++]= (_temp)>>8;
    data_to_send[_cnt++]= (_temp);
    _temp = (int32_t)(angle_yaw*100);
    data_to_send[_cnt++]= (_temp)>>8;
    data_to_send[_cnt++]= (_temp);
    
    data_to_send[_cnt++]= (_temp2)>>24;
    data_to_send[_cnt++]= (_temp2)>>16;
    data_to_send[_cnt++]= (_temp2)>>8;
    data_to_send[_cnt++]= (_temp2);
    
    data_to_send[_cnt++] = fly_model;
    
    data_to_send[_cnt++] = armed;
    
    data_to_send[3] = _cnt-4;
    
