lee-lord/GD32F303RET6/hardware/UART_DMA/UART_DMA.c
typedef struct {
    unsigned int index;
    unsigned char *buf;
} BUFFERCS;
//add by lee 2015-10-28 to fill all the char into a buf ,and then ,send total once.
void writeOneByte2Buffer(BUFFERCS *pts,unsigned char Chr)
{
  if(pts->index>255) return;
  pts->buf[pts->index]=Chr;
  pts->index++;

}

char * ultoa_invert (uint32_t val, char *s, uint8_t base) {
    if (base == 8) {
        do {
            *s = '0' + (val & 0x7);
            val >>= 3;
        } while(val);
        return s;
    }

    if (base == 16) {
        do {
            uint8_t digit = '0' + (val & 0xf);
#if XTOA_UPPER == 0
            if (digit > '0' + 9)
                digit += ('a' - '0' - 10);
#else
            if (digit > '0' + 9)
                digit += ('A' - '0' - 10);
#endif
            *s++ = digit;
            val >>= 4;
        } while(val);
        return s;
    }

    // Every base which in not hex and not oct is considered decimal.

    // 33 bits would have been enough.
    uint64_t xval = val;
    do {
        uint8_t saved = xval;
        xval &= ~1;
        xval += 2;
        xval += xval >> 1;      // *1.5
        xval += xval >> 4;      // *1.0625
        xval += xval >> 8;      // *1.00390625
        xval += xval >> 16;     // *1.000015259
        xval += xval >> 32;     // it all amounts to *1.6
        xval >>= 4;             // /16 ... so *1.6/16 is /10, fraction truncated.
        *s++ = '0' + saved - 10 * (uint8_t)xval;
    } while (xval);
    return s;
}

void print_vprintf (U8 UartX,const U8 *fmt, va_list ap)
{
        unsigned char c;        /* holds a char from the format string */
        unsigned char flags;
        unsigned char width;
        unsigned char prec;
        unsigned char buf[13];
        unsigned char _buffer[256];
                        int exp;                /* exponent of master decimal digit     */
                        int n;
                        unsigned char vtype;    /* result of float value parse  */
                        unsigned char sign;     /* sign character (or 0)        */
                        unsigned char ndigs;
                        float value;

        BUFFERCS vComBuf;
        vComBuf.buf=_buffer;
        vComBuf.index=0;
        for (;;) {
                /*
                 * Process non-format characters
                 */
                for (;;) {
                        c = *(fmt++);// (in_progmem, 1, fmt);
                        if (!c) {
                            if(UartX==0)
                               UartA_write(vComBuf.buf,vComBuf.index);
                            else if(UartX==1)
                               UartB_write(vComBuf.buf,vComBuf.index);
                            else if(UartX==2)
                                UartC_write(vComBuf.buf,vComBuf.index);
                            return;
                             } 
                        if (c == '%') {
                                c = *(fmt++);// (in_progmem, 1, fmt);
                                if (c != '%') break;
                        }
                        /* emit cr before lf to make most terminals happy */
                        if (c == '\n')
                               writeOneByte2Buffer(&vComBuf,'\r');//  s->write('\r');
                        writeOneByte2Buffer(&vComBuf,c);// s->write(c);
                }

                flags = 0;
                width = 0;
                prec = 0;
                
                /*
                 * Process format adjustment characters, precision, width.
                 */
                do {
                        if (flags < FL_WIDTH) {
                                switch (c) {
                                case '0':
                                        flags |= FL_ZFILL;
                                        continue;
                                case '+':
                                        flags |= FL_PLUS;
                                        /* FALLTHROUGH */
                                case ' ':
                                        flags |= FL_SPACE;
                                        continue;
                                case '-':
                                        flags |= FL_LPAD;
                                        continue;
                                case '#':
                                        flags |= FL_ALT;
                                        continue;
                                }
                        }

                        if (flags < FL_LONG) {
                                if (c >= '0' && c <= '9') {
                                        c -= '0';
                                        if (flags & FL_PREC) {
                                                prec = 10*prec + c;
                                                continue;
                                        }
                                        width = 10*width + c;
                                        flags |= FL_WIDTH;
                                        continue;
                                }
                                if (c == '.') {
                                        if (flags & FL_PREC)
                                               {
                                                if(UartX==0)
                                                   UartA_write(vComBuf.buf,vComBuf.index);
                                                else if(UartX==1)
                                                   UartB_write(vComBuf.buf,vComBuf.index);
                                                else if(UartX==2)
                                                    UartC_write(vComBuf.buf,vComBuf.index);                                                
                                                    return;
                                                } 
                                        flags |= FL_PREC;
                                        continue;
                                }
                                if (c == 'l') {
                                        flags |= FL_LONG;
                                        continue;
                                }
                                if (c == 'h')
                                        continue;
                        }
            
                        break;
                } while ( (c = *(fmt++))!= 0);// (in_progmem, 1, fmt)) != 0);

