lee-lord/GD32F303RET6/hardware/UART_DMA/UART_DMA.c
                /*
                 * Handle floating-point formats E, F, G, e, f, g.
                 */
                if (c >= 'E' && c <= 'G') {
                        flags |= FL_FLTUPP;
                        c += 'e' - 'E';
                        goto flt_oper;

                } else if (c >= 'e' && c <= 'g') {

                        // int exp;                /* exponent of master decimal digit     */
                        // int n;
                        // unsigned char vtype;     result of float value parse  
                        // unsigned char sign;     /* sign character (or 0)        */
                        // unsigned char ndigs;
                        // float value;
                        flags &= ~FL_FLTUPP;

                flt_oper:
                        value = va_arg(ap,double);
                        if (!(flags & FL_PREC))
                                prec = 6;
                        flags &= ~(FL_FLTEXP | FL_FLTFIX);
                        if (c == 'e') {
                                flags |= FL_FLTEXP;
                        } else if (c == 'f') {
                                flags |= FL_FLTFIX;
                        } else if (prec > 0)
                                prec -= 1;
                        if ((flags & FL_FLTFIX) && (fabs(value) > 9999999)) {
                                flags = (flags & ~FL_FLTFIX) | FL_FLTEXP;
                        }

                        if (flags & FL_FLTFIX) {
                                vtype = 7;              /* 'prec' arg for 'ftoa_engine' */
                                ndigs = prec < 60 ? prec + 1 : 60;
                        } else {
                                if (prec > 10) prec = 10;
                                vtype = prec;
                                ndigs = 0;
                        }
                        memset(buf, 0, sizeof(buf));
                        exp = ftoa_engine(value, (char *)buf, vtype, ndigs);
                        vtype = buf[0];
    
                        sign = 0;
                        if ((vtype & FTOA_MINUS) && !(vtype & FTOA_NAN))
                                sign = '-';
                        else if (flags & FL_PLUS)
                                sign = '+';
                        else if (flags & FL_SPACE)
                                sign = ' ';

                        if (vtype & (FTOA_NAN | FTOA_INF)) {
                                ndigs = sign ? 4 : 3;
                                if (width > ndigs) {
                                        width -= ndigs;
                                        if (!(flags & FL_LPAD)) {
                                                do {
                                                       writeOneByte2Buffer(&vComBuf,' ');//s->write(' ');
                                                } while (--width);
                                        }
                                } else {
                                        width = 0;
                                }
                                if (sign)
                                       writeOneByte2Buffer(&vComBuf,sign);//  s->write(sign);
                                const U8 *p = "inf";
                                if (vtype & FTOA_NAN)
                                        p = "nan";
                                while ( (ndigs = (*p)) != 0) {
                                        if (flags & FL_FLTUPP)
                                                ndigs += 'I' - 'i';
                                         writeOneByte2Buffer(&vComBuf,ndigs);//s->write(ndigs);
                                        p++;
                                }
                                goto tail;
                        }

                        /* Output format adjustment, number of decimal digits in buf[] */
                        if (flags & FL_FLTFIX) {
                                ndigs += exp;
                                if ((vtype & FTOA_CARRY) && buf[1] == '1')
                                        ndigs -= 1;
                                if ((signed char)ndigs < 1)
                                        ndigs = 1;
                                else if (ndigs > 8)
                                        ndigs = 8;
                        } else if (!(flags & FL_FLTEXP)) {              /* 'g(G)' format */
                                if (exp <= prec && exp >= -4)
                                        flags |= FL_FLTFIX;
                                while (prec && buf[1+prec] == '0')
                                        prec--;
                                if (flags & FL_FLTFIX) {
                                        ndigs = prec + 1;               /* number of digits in buf */
                                        prec = prec > exp
                                                ? prec - exp : 0;       /* fractional part length  */
                                }
                        }
    
                        /* Conversion result length, width := free space length */
                        if (flags & FL_FLTFIX)
                                n = (exp>0 ? exp+1 : 1);
                        else
                                n = 5;          /* 1e+00 */
                        if (sign) n += 1;
                        if (prec) n += prec + 1;
                        width = width > n ? width - n : 0;
    
                        /* Output before first digit    */
                        if (!(flags & (FL_LPAD | FL_ZFILL))) {
                                while (width) {
                                         writeOneByte2Buffer(&vComBuf,' ');//s->write(' ');
                                        width--;
                                }
                        }
                        if (sign)  writeOneByte2Buffer(&vComBuf,sign);// //s->write(sign);
                        if (!(flags & FL_LPAD)) {
                                while (width) {
                                        writeOneByte2Buffer(&vComBuf,'0');// s->write('0');
                                        width--;
                                }
                        }
    
