lee-lord/GD32F303RET6/hardware/UART_DMA/UART_DMA.c
                        if (flags & FL_FLTFIX) {                /* 'f' format           */

                                n = exp > 0 ? exp : 0;          /* exponent of left digit */
                                do {
                                        if (n == -1)
                                                writeOneByte2Buffer(&vComBuf,'.');// s->write('.');
                                        flags = (n <= exp && n > exp - ndigs)
                                                ? buf[exp - n + 1] : '0';
                                        if (--n < -prec || flags == 0)
                                                break;
                                         writeOneByte2Buffer(&vComBuf,flags);//s->write(flags);
                                } while (1);
                                if (n == exp
                                    && (buf[1] > '5'
                                        || (buf[1] == '5' && !(vtype & FTOA_CARRY))) )
                                        {
                                                flags = '1';
                                        }
                                if (flags)  writeOneByte2Buffer(&vComBuf,flags);//s->write(flags);
        
                        } else {                                /* 'e(E)' format        */

                                /* mantissa     */
                                if (buf[1] != '1')
                                        vtype &= ~FTOA_CARRY;
                                 writeOneByte2Buffer(&vComBuf,buf[1]);//s->write(buf[1]);
                                if (prec) {
                                         writeOneByte2Buffer(&vComBuf,'.');//s->write('.');
                                        sign = 2;
                                        do {
                                                 writeOneByte2Buffer(&vComBuf,buf[sign++]);//s->write(buf[sign++]);
                                        } while (--prec);
                                }

                                /* exponent     */
                                 writeOneByte2Buffer(&vComBuf,flags & FL_FLTUPP ? 'E' : 'e');//s->write(flags & FL_FLTUPP ? 'E' : 'e');
                                ndigs = '+';
                                if (exp < 0 || (exp == 0 && (vtype & FTOA_CARRY) != 0)) {
                                        exp = -exp;
                                        ndigs = '-';
                                }
                                 writeOneByte2Buffer(&vComBuf,ndigs);//s->write(ndigs);
                                for (ndigs = '0'; exp >= 10; exp -= 10)
                                        ndigs += 1;
                                 writeOneByte2Buffer(&vComBuf,ndigs);//s->write(ndigs);
                                 writeOneByte2Buffer(&vComBuf,'0'+exp);//s->write('0' + exp);
                        }

                        goto tail;
                }

                /*
                 * Handle string formats c, s, S.
                 */
                {
                        const char * pnt;
                        size_t size;

                        switch (c) {

                        case 'c':
                                buf[0] = va_arg (ap, int);
                                pnt = (char *)buf;
                                size = 1;
                                goto no_pgmstring;

                        case 's':
                                pnt = va_arg (ap, char *);
                                size = con_strnlen(pnt, (flags & FL_PREC) ? prec : ~0);
                        no_pgmstring:
                                flags &= ~FL_PGMSTRING;
                                goto str_lpad;

                        case 'S':
                        // pgmstring: // not yet used
                                pnt = va_arg (ap, char *);
                                size = con_strnlen(pnt, (flags & FL_PREC) ? prec : ~0);
                                flags |= FL_PGMSTRING;

                        str_lpad:
                                if (!(flags & FL_LPAD)) {
                                        while (size < width) {
                                                writeOneByte2Buffer(&vComBuf,' ');// s->write(' ');
                                                width--;
                                        }
                                }
                                while (size) {
                                        writeOneByte2Buffer(&vComBuf,*(fmt++));// s->write(*(fmt++);//(flags,FL_PGMSTRING,pnt) (flags, FL_PGMSTRING, pnt));
                                        if (width) width -= 1;
                                        size -= 1;
                                }
                                goto tail;
                        }
                }

                /*
                 * Handle integer formats variations for d/i, u, o, p, x, X.
                 */
                if (c == 'd' || c == 'i') {
                        long x = (flags & FL_LONG) ? va_arg(ap,long) : va_arg(ap,int);
                        flags &= ~(FL_NEGATIVE | FL_ALT);
                        if (x < 0) {
                                x = -x;
                                flags |= FL_NEGATIVE;
                        }
                        c = ultoa_invert (x, (char *)buf, 10) - (char *)buf;

                } else {
                        int base;

                        if (c == 'u') {
                                flags &= ~FL_ALT;
                                base = 10;
                                goto ultoa;
                        }

                        flags &= ~(FL_PLUS | FL_SPACE);

                        switch (c) {
                        case 'o':
                                base = 8;
                                goto ultoa;
                        case 'p':
                                flags |= FL_ALT;
                                /* no break */
                        case 'x':
                                if (flags & FL_ALT)
                                        flags |= FL_ALTHEX;
                                base = 16;
                                goto ultoa;
                        case 'X':
                                if (flags & FL_ALT)
                                        flags |= (FL_ALTHEX | FL_ALTUPP);
                                base = 16 | XTOA_UPPER;
                        ultoa:
                                c = ultoa_invert ((flags & FL_LONG)
                                                    ? va_arg(ap, unsigned long)
                                                    : va_arg(ap, unsigned int),
                                                    (char *)buf, base)  -  (char *)buf;
                                flags &= ~FL_NEGATIVE;
                                break;

                        default:
                               {
                                if(UartX==0)
                                    UartA_write(vComBuf.buf,vComBuf.index);
                                else if(UartX==1)
                                     UartB_write(vComBuf.buf,vComBuf.index);
                                else if(UartX==2)
                                        UartC_write(vComBuf.buf,vComBuf.index);//s->write(vComBuf.buf,vComBuf.index);
                               return;
                               } //return;
                        }
                }

