lee-lord/GD32F303RET6/hardware/UART_DMA/UART_DMA.c
                /*
                 * Format integers.
                 */
                {
                        unsigned char len;

                        len = c;
                        if (flags & FL_PREC) {
                                flags &= ~FL_ZFILL;
                                if (len < prec) {
                                        len = prec;
                                        if ((flags & FL_ALT) && !(flags & FL_ALTHEX))
                                                flags &= ~FL_ALT;
                                }
                        }
                        if (flags & FL_ALT) {
                                if (buf[c-1] == '0') {
                                        flags &= ~(FL_ALT | FL_ALTHEX | FL_ALTUPP);
                                } else {
                                        len += 1;
                                        if (flags & FL_ALTHEX)
                                                len += 1;
                                }
                        } else if (flags & (FL_NEGATIVE | FL_PLUS | FL_SPACE)) {
                                len += 1;
                        }

                        if (!(flags & FL_LPAD)) {
                                if (flags & FL_ZFILL) {
                                        prec = c;
                                        if (len < width) {
                                                prec += width - len;
                                                len = width;
                                        }
                                }
                                while (len < width) {
                                         writeOneByte2Buffer(&vComBuf,' ');//s->write(' ');
                                        len++;
                                }
                        }
        
                        width =  (len < width) ? width - len : 0;

                        if (flags & FL_ALT) {
                                 writeOneByte2Buffer(&vComBuf,'0');//s->write('0');
                                if (flags & FL_ALTHEX)
                                 writeOneByte2Buffer(&vComBuf,flags & FL_ALTUPP ? 'X' : 'x');//  s->write(flags & FL_ALTUPP ? 'X' : 'x');
                        } else if (flags & (FL_NEGATIVE | FL_PLUS | FL_SPACE)) {
                                unsigned char z = ' ';
                                if (flags & FL_PLUS) z = '+';
                                if (flags & FL_NEGATIVE) z = '-';
                                 writeOneByte2Buffer(&vComBuf,z);//s->write(z);
                        }
                
                        while (prec > c) {
                                writeOneByte2Buffer(&vComBuf,'0');// s->write('0');
                                prec--;
                        }
        
                        do {
                                writeOneByte2Buffer(&vComBuf,buf[--c]);// s->write(buf[--c]);
                        } while (c);
                }
        
        tail:
                /* Tail is possible.    */
                while (width) {
                         writeOneByte2Buffer(&vComBuf,' ');//s->write(' ');
                        width--;
                }
        } /* for (;;) */
	}


void UCprintf(const U8 *fmt, ...)
{
    va_list arg_list;
    va_start(arg_list, fmt);
    print_vprintf (2,fmt, arg_list);
    va_end(arg_list);
}

void UAprintf(const U8 *fmt, ...)
{
    va_list arg_list;
    // U8 buf[256];
    // memset(buf,0,256);
    va_start(arg_list, fmt);
     print_vprintf (0,fmt, arg_list);
    //sprintf(buf,fmt,arg_list);
    va_end(arg_list);
    //UartA_write(buf,strlen(buf));
}







